fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/BKM_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.BKM_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Диаграмма.Очистить();
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ТекстСообщения = "Построение диаграммы не возможно. Ошибка получения данных для построения графика.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);  		
	
	СерияОтпуска = Диаграмма.Серии.Добавить();
	СерияОтпуска.Текст = "Отпуск";
	СерияОтпуска.Цвет = WebЦвета.ЗеленыйЛес;
	
	СерияПродолжительногоОтпуска = Диаграмма.Серии.Добавить();
	СерияПродолжительногоОтпуска.Текст = "Отпуск более 28 дней";
	СерияПродолжительногоОтпуска.Цвет = WebЦвета.Томатный;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BKM_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	BKM_ГрафикОтпусковОтпускаСотрудников.ВсегоДней КАК ВсегоДней,
	|	BKM_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	BKM_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.BKM_ГрафикОтпусков.ОтпускаСотрудников КАК BKM_ГрафикОтпусковОтпускаСотрудников
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Точка = Диаграмма.УстановитьТочку(Выборка.Сотрудник);
		Точка.Текст = Выборка.Сотрудник; 
		
		Если Выборка.ВсегоДней > 28 Тогда 
			Серия = СерияПродолжительногоОтпуска;
		Иначе     
			Серия = СерияОтпуска;
		КонецЕсли;  
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Выборка.ДатаНачала);
		Интервал.Конец = КонецДня(Выборка.ДатаОкончания);  
	КонецЦикла;	
	
	
КонецПроцедуры  

#КонецОбласти
